# Создать список состоящий из отдельных единичных символов, преобразовать список в строку, инвертировать строку и
# вывести на печать.

my_list = ['I', 'am', 'Python', 'developer']
my_list_1 = ''.join(my_list)[::-1]
print(my_list_1)
