# Создать три переменные, содержащие возраст трех ваших друзей, в качестве имен переменных использовать имена друзей,
# найти сумму и вывести ее на экран.

age_dima = 35
age_max = 34
age_kolya = 33
age_sum = age_dima + age_max + age_kolya
print(age_sum)
