# Создать переменную содержащую сторону квадрата, создать новый список, в котором будут периметр квадрата,
# площадь квадрата и диагональ квадрата.

side_square = 10
my_list = [4 * side_square, side_square * side_square, side_square * 2 ** 0.5]
print(my_list)
