# Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран.

age_dima = 35
age_max = 34
age_kolya = 33
age_sum = age_dima + age_max + age_kolya
age_average = age_sum / 3
print(age_average)
